class Constants {
  static List<Article> newsData = [
    Article(
        title: """
    الصناعة والثروة المعدنية: أكثر من 10 آلاف مصنع في المملكة تتوزع على 16 قطاعاً صناعياً استراتيجياً
    """,
        imageURL: "https://mim.gov.sa/uploads/news/2679261271625742515.JPG",
        date: "2021-08-09",
        description: """
    كشف تقرير صادر عن المركز الوطني للمعلومات الصناعية والتعدينية في وزارة الصناعة والثروة المعدنية أن القطاع الصناعي في المملكة يضم أكثر من 16 قطاعا استراتيجيا موزعة على 13 منطقة إدارية في جميع أنحاء المملكة، تضم حوالي 10138 مصنعا حتى نهاية يوليو الماضي. وأشار التقرير إلى أن القطاعات الاستراتيجية في المملكة، تنوعت بين صناعة المعادن، والمنتجات الغذائية والبلاستيكية، ومصانع الآلات والمعدات، وصناعة الكيماويات المتخصصة، والكيماويات الأساسية والمتوسطة، ومصانع السيارات، ومنتجات تكرير النفط، إضافة إلى مصانع الأدوية ومصانع المستلزمات الطبية ومصادر الطاقة المتجددة والصناعات البحرية والطيران والصناعات العسكرية، ومصانع مواد البناء. وأكد تقرير المركز الوطني للمعلومات الصناعية والتعدينية، أن مصانع مواد البناء من أكثر المصانع حسب القطاعات الاستراتيجية في المملكة بحوالي 2،016 مصنعاً، تليها المصانع العاملة في إنتاج المعادن بنحو 1705، ثم مصانع المواد الغذائية بـ 1445 مصنعًا، تليها مصانع المنتجات البلاستيكية والمطاطية بحوالي 1317مصنعًا، ثم مصانع الآلات والمعدات بنحو 571 مصنعًا. وبين التقرير أن عدد مصانع الكيماويات المتخصصة في المملكة بلغ حوالي 571 مصنعاً، تليها مصانع الكيماويات الأساسية والمتوسطة بـ 399 مصنعاً، بينما جاءت مصانع السيارات بـ 169 مصنعاً، ومنتجات تكرير النفط بـ 122، ومصانع الأدوية بـ 75 مصنعاً، ثم مصانع المستلزمات الطبية التي بلغت حوالي 49 مصنعًا، ومصادر الطاقة المتجددة بنحو 9 مصانع، في حين جاءت المصانع البحرية، ومصانع الطيران بـ4 مصانع لكل منهما، بينما سجلت المصانع العسكرية أقل القطاعات الاستراتيجية من حيث عدد المصانع بمصنع واحد فقط. وأشار تقرير المركز الوطني للمعلومات الصناعية والتعدينية إلى أن منطقة الرياض سجلت أكبر نسبة من حيث عدد المصانع في المملكة بـ 4079 مصنعاً، تليها المنطقة الشرقية بـ 2206 مصنع، ثم مكة المكرمة بـ1911مصنعاً، ومنطقة القصيم بـ 428، تليها منطقة المدينة المنورة التي سجلت نحو 416 مصنعا، فيما كانت منطقة الحدود الشمالية، ونجران والباحة، من أقل المناطق الإدارية في المملكة من حيث عدد المصانع بأقل من 100 مصنع في كل منطقة.
    """),
    Article(
        title: """
"الصناعة والثروة المعدنية" تنفّذ 4729 زيارة ميدانية على المنشآت الصناعية خلال النصف الأول من 2021
    """,
        imageURL: "https://mim.gov.sa/uploads/news/13680797291626363119.JPG",
        date: "2021-08-17",
        description: """
نفّذت فرق الرقابة في وزارة الصناعة والثروة المعدنية ممثلة في إدارة المتابعة والرقابة الصناعية نحو 4729 زيارة ميدانية على المنشآت الصناعية في جميع مناطق المملكة، وذلك خلال النصف الأول من عام 2021؛ للتأكد من التزامها بمعايير الجودة والاشتراطات اللازمة. وأوضحت الوزارة في بيان صحافي، أن الجولات المنفّذة اشتملت على 479 زيارة بمشاركة جهات حكومية ذات علاقة بالقطاع الصناعي، فيما الزيارات المتبقية والبالغ عددها 4250 زيارة نفذتها الفرق الرقابية في وزارة الصناعة والثروة المعدنية. وأشارت وزارة الصناعة والثروة المعدنية إلى أن الزيارات الميدانية التي تم تنفيذها على مصانع منطقة الرياض بلغت 1765 زيارة في ستة أشهر، و1022 زيارة في مصانع منطقة مكة المكرمة، فيما نفّذت 1084 زيارة على مصانع المنطقة الشرقية، و228 زيارة على مصانع منطقة عسير، و203 لمصانع منطقة القصيم، إضافة إلى 144 في مصانع منطقة المدينة المنورة، و46 في منطقة حائل، كما نفّذت الوزارة 66 زيارة في منطقة جازان، و33 في منطقة نجران، و51 زيارة في منطقة الباحة، إضافة إلى 25 زيارة ميدانية في منطقة تبوك، و38 زيارة في منطقة الجوف، و24 في منطقة الحدود الشمالية. ولفتت إلى أن، فرقها الرقابية ستواصل تنفيذ زياراتها الميدانية للتأكد من التزام المنشآت الصناعية من تطبيق المعايير والاشتراطات اللازمة، وذلك لمتابعة التزام المصانع الوطنية بتوفير منتجات ذات جودة عالية، ومطابقة للمعايير والمواصفات المعتمدة. كما تستهدف زيارات الوزارة للمصانع، التأكد من التزامها بإجراءات الأمن والسلامة، حيث يشترط على أي منشأة صناعية الحصول على رخصة سلامة صادرة من الدفاع المدني، وتوفيرها وسائل السلامة تبعاً لطبيعة النشاط وخطورته، إضافة إلى التأكد من توفر مخارج الطوارئ، ونظام للإطفاء، وتخزين المواد الخام والمنتجات بطريقة آمنة. وتؤكد هذه الزيارات، حرص الوزارة على دعم الصناعات المحلية في جميع القطاعات، ومتابعة جودة المنتج المحلي، وتعزيز التعاون مع شركاء الوزارة من المصانع الوطنية في عكس صورة إيجابية عن جودة هذه المنتجات، وقدرتها على المنافسة، وما وصلت له هذه المنتجات من جودة، إضافة إلى توفير احتياج السوق وتعزيز المعروض فيه.
    """),
    Article(
        title: """
وزارة الصناعة والثروة المعدنية تعلن عن منصتها الرقمية الجديدة
    """,
        imageURL: "https://mim.gov.sa/uploads/news/13248691441628582115.jpg",
        date: "2021-08-09",
        description: """
أعلنت وزارة الصناعة والثروة المعدنية، عن منصتها الرقمية الجديدة لخدمة المستثمرين في قطاعي الصناعة والتعدين، وذلك في حفل أقيم اليوم الخميس في الرياض، بحضور معالي وزير الصناعة والثروة المعدنية الأستاذ بندر بن إبراهيم الخريف، ومعالي رئيس الهيئة السعودية للبيانات والذكاء الاصطناعي، الدكتور عبد الله بن شرف الغامدي، وعدد من قيادات منظومتي الصناعة والتعدين، والهيئة السعودية للبيانات والذكاء الاصطناعي. وكشفت الوزارة عن أن المنصة الجديدة تضم أكثر من 26 خدمة تقنية تقدمها الوزارة بشكل مباشر تحت مسمى "mim"، وأكثر من 31 خدمة تقنية أخرى تقدمها منظومة الصناعة والثروة المعدنية تحت مسمى “mim+”، إضافة إلى ما يزيد على14 خدمة أخرى تقدمها الجهات الحكومية الشريكة تحت مسمى "mim++"، وهي مجموعة من الخدمات التي يحتاجها المستثمر في قطاعي الصناعة والتعدين، مؤكدةً عزمها على مواصلة الجهود لتحقيق التطلعات الوطنية التي تهدف إلى خدمة قطاعي الصناعة والثروة المعدنية. من جهته، قال معالي نائب وزير الصناعة والثروة المعدنية المهندس أسامة بن عبدالعزيز الزامل إن هذه الإجراءات تأتي انطلاقاً من مستهدفات رؤية المملكة التي تهدف إلى تشجيع الاستثمارات الصناعية، من خلال توفير بيئة صناعية جاذبة ومستقرة، تعزز تنافسية قطاع الصناعة محلياً ودولياً، وتزيد من قيمة المحتوى المحلي، وتدعم المنتجات المحلية بمختلف أشكالها، مضيفاً أنه كان لزاماً على وزارة الصناعة والثروة المعدنية أن تسخر كافة الطاقات والقدرات لتحقيق تطلعات قيادتنا الرشيدة، في التمكين الرقمي لجميع مجالات العمل وأتمتة جميع الخدمات. وبيّن معاليه أن الوزارة أطلقت خدماتها الرقمية لتسهيل وصول المستفيدين إلى جميع الخدمات عبر عدة قنوات وخدمات إلكترونية، ويأتي ذلك سعيا من الوزارة إلى تسهيل رحلة الشركاء في القطاع الصناعي، مع توفير الكثير من الوقت والجهد، وتسهيل الوصول لخدمات الوزارة، ومن بينها الخدمات الصناعية، التي تشمل خدمة الترخيص الصناعي الجديد، وخدمة الإعفاء الجمركي، وخدمة تأييد العمالة، وخدمة الفسح الكيميائي، وأكثر من 50 خدمة أخرى يمكن لشركاء الوزارة الاستفادة منها. وبدوره قال معالي مساعد وزير الصناعة والثروة المعدنية للتخطيط والتطوير الدكتور سامي بن محمد الحمود خلال الحفل أن الخدمات المقدمة عبر المنصة الرقمية الجديدة، تأتي في إطار التكامل الحكومي بين مختلف الجهات، الأمر الذي ساهم بشكل كبير في التميز على مستوى البنية التحتية الرقمية، وجودة الخدمات، وسرعة الإنجاز، وتحسين رحلة المستثمر في قطاعي الصناعة والتعدين، مؤكداً على أن النضج الكبير الذي تشهده المملكة اليوم في رحلة التحول الرقمي يعكس مدى التقدم التقني الباهر الذي حققته الجهات الحكومية بدعم كبير من مختلف الجهات ذات العلاقة. وأوضح معاليه أن وزارة الصناعة والثروة المعدنية عملت بالتكامل مع الجهات الحكومية الشريكة لإيجاد خدمات موحدة تسهل رحلة المستثمر الصناعي والتعديني الرقمية وذلك بهدف إيجاد بيئة رقمية أكثر سهولة ومرونة، حيث تم تصنيف وتوحيد الخدمات الرقمية لشركائنا في القطاع الصناعي والتعديني، وبما يسهم في تحقيق توجهات القيادة الداعمة لرحلة التحول الرقمي، مبينا أن هناك انسجام كبير بين جميع الجهات الحكومية ومنظومة الصناعة والثروة المعدنية، لكي تكون الخدمات المقدمة واضحة وسهلة، وتوفير قناة رقمية موحدة لتقديم كافة الخدمات التي تلبي تطلعات شركائنا في القطاع الخاص.
    """),
    Article(
        title: """
وزارة الصناعة والثروة المعدنية توقع اتفاقية تعاون مع "سدايا"
    """,
        imageURL: "https://mim.gov.sa/uploads/news/14310774531626563959.JPG",
        date: "2021-08-09",
        description: """
وقعت وزارة الصناعة والثروة المعدنية، والهيئة السعودية للبيانات والذكاء الاصطناعي "سدايا"، اتفاقية تعاون لاستضافة مركز بيانات وزارة الصناعة والثروة المعدنية في السحابة الحكومية "ديم"، وذلك في إطار جهود الوزارة لتحقيق التكامل الحكومي والمحافظة على معايير الأمن السيبراني وتحقيق البيئة التقنية الرقمية الآمنة. وتهدف هذه الاتفاقية إلى تقديم حلول مبتكرة تساهم في توطين التقنية في مجال البيانات والذكاء الاصطناعي، ودراسة المشاكل وتقديم الحلول الذكية في تطبيقات الذكاء الاصطناعي من أجل تمكين الوزارة من تشغيل وإعداد بيئات البنية التحتية لخدمات السحابة الحكومية. بدورها، تسعى "سدايا" إلى تعزيز التكامل الحكومي، وتسخير بنيتها التحتية لدعم التحول الرقمي، حيث ستتيح السحابة الحكومية "ديم" لوزارة الصناعة والثروة المعدنية من إدارة عملياتها التقنية بسلاسة ويمكنها من تقديم خدماتها للمستفيدين بمرونه وموثوقية. يذكر أن السحابة الحكومية"ديم" تُعدّ اليوم الأكبر من نوعها في منطقة الشرق الأوسط، وأحد الحلول التقنية والابتكارية التي تساهم في دعم الجهات الحكومية نحو التحوّل الرقمي، بما يتواكب مع تطلعات قيادتنا الرشيدة - حفظها الله - ويتوافق مع رؤية المملكة 2030، فمن خلال منصة "ديم"و بنيتها التحتية المبنية على أحدث التقنيات التي تضمن الأمان والموثوقية للبيانات الحكومية، سوف تساهم في خفض الإنفاق الحكومي على إدارة وحماية وتشغيل وصيانة البُنى التحتية، كما تسعى "سدايا" من خلال هذه المنصة إلى توحيد مراكز البيانات في القطاعات الحكومية لدعم جهودها في رفع كفاءة التشغيل لهذه المراكز.
    """),
  ];
  static List<Service> servicesData = [
    Service(
        title:
            "The Internal Portal for employees the Ministry of Industry and Mineral Resources employees",
        subtitle:
            "The Internal Portal for employees the Ministry of Industry and Mineral Resources employees",
        rate: 0,
        description:
            "The internal portal is the starting point to access all the E-services needed by the employees of the ministry of Industry and Mineral Resources"),
    Service(
        title:
            "The Internal Portal for employees the Ministry of Industry and Mineral Resources employees",
        subtitle:
            "The Internal Portal for employees the Ministry of Industry and Mineral Resources employees",
        rate: 3,
        description:
            "The internal portal is the starting point to access all the E-services needed by the employees of the ministry of Industry and Mineral Resources"),
    Service(
        title:
            "The Internal Portal for employees the Ministry of Industry and Mineral Resources employees",
        subtitle:
            "The Internal Portal for employees the Ministry of Industry and Mineral Resources employees",
        rate: 4,
        description:
            "The internal portal is the starting point to access all the E-services needed by the employees of the ministry of Industry and Mineral Resources"),
    Service(
        title:
            "The Internal Portal for employees the Ministry of Industry and Mineral Resources employees",
        subtitle:
            "The Internal Portal for employees the Ministry of Industry and Mineral Resources employees",
        rate: 2,
        description:
            "The internal portal is the starting point to access all the E-services needed by the employees of the ministry of Industry and Mineral Resources"),
  ];
}

class Article {
  String title;
  String imageURL;
  String date;
  String description;

  Article({
    required this.title,
    required this.imageURL,
    required this.date,
    required this.description,
  });
}

class Service {
  String title;
  String subtitle;
  int rate;
  String description;

  Service({
    required this.title,
    required this.subtitle,
    required this.rate,
    required this.description,
  });
}
